<template>
  <div class="container">
    <h1 class="s-mt">
      Уведомления
    </h1>
    <div class="alert alert__no-read">
      Уважаемые представители компании ООО «Крылатый Автовоз»! Для лота <b>№ 00834</b> был выбран другой перевозчик.
    </div>
    <div class="alert">
      Уважаемые представители компании ООО «Крылатый Автовоз»! Для лота <b>№ 00935</b> был выбран другой перевозчик.
    </div>
    <div class="alert">
      Уважаемые представители компании <span class="alert__red">(наименование компании пользователя)</span>! Вы были выбраны для перевозки лота (номер лота). Для продолжения работы вам нужно заполнить данные водителя и автовоза на странице лота. Заполнение данных доступно до (вывести дату и время окончания заполнения формы регистрации, которая доступна в течении 2-х часов после получения текущего уведомления)
      <a href="#">Перейти в лот</a>
    </div>
    <div class="alert">
      Уважаемые представители компании ООО «Крылатый Автовоз»!  Время подтверждения лота № 00535 истекло, лот вернулся в свободные заявки
    </div>
    <div class="alert">
      Уважаемые представители компании ООО «Крылатый Автовоз»! В лоте № 00535 произошла замена товарного автомобиля. Корректный состав лота уже доступен к просмотру. Вам необходимо сформировать обновленную доверенность.
    </div>
    <div class="alert">
      Уважаемые представители компании ООО «Крылатый Автовоз»! Лот № 00535 снят с погрузки по решению заказчика.
    </div>
    <div class="alert">
      Уважаемые представители компании (наименование компании пользователя)! Просим вас обновить информацию о местонахождении автовозов и факт доставки в лотах (номер лота1, номер лота2, номер лотаN) Ссылка на страницу установки точек маршрута
      <a href="#">Перейти в лот</a>
    </div>
  </div>
</template>

<style scoped lang="scss">
  .alert{
    padding: 40px;
    background: #F9F9F9;
    border: 1px solid transparent;
    border-radius: 29px;
    margin-bottom: 24px;

    &__no-read{
      border-color: rgba(237, 28, 36, 0.51);
    }
  }
</style>
